The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public int NumberOfVertices { get; }
  Visual Basic
Public ReadOnly Property NumberOfVertices As Integer
	Get
  Visual C++
public:
property int NumberOfVertices {
	int get ();
}
 See Also
  TriOrQuadFacet Class
  Autodesk.Revit.DB Namespace